{
  "auto_mapping": {
    "base_model_class": "BertForSequenceClassification",
    "parent_library": "transformers.models.bert.modeling_bert"
  },
  "base_model_name_or_path": "google-bert/bert-base-uncased",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "revision": null,
  "target_modules": [
    "query",
    "value"
  ],
  "task_type": null
}